from math import tan, sqrt
R = int(input ("Добрый день! Введите радиус круга в сантиметрах: "))
L = 2*3.14*R
print(L)
S = 3.14*(R*R)
Lm = L/100
Sm = S/10000
A= f"Длина окружности равна {L} см или {Lm} м. Площадь круга равна {S} см кв или {Sm} м кв"
print (A)
Q = R*(2**0.5)
Qm = Q/100
W = R*(3**0.5)
Wm = W/100
O = f"Сторона вписаного квадрата равна {Q} см или {Qm} м. Сторона вписаного равносторонего треугольника равна {W} см или {Wm} м"
print (O)
E = 2*R
Em = E/100
T = 2*R*(3**0.5)
Tm = T/100
Y = 2*R*(sqrt(2)-1)
Ym = Y/100
P = f"Сторона описаного квадрата равна {E} см или {Em} м. Сторона описаного треугольникаравна {T} см или {Tm} м. Сторона описаного восьмиугольника равна {Y} см или {Ym} м."
print (P)
